#Дано трехзначное число. Используя одну операцию деления нацело
#вывести первуую цифру данного числа (сотни).

a = int(input("Введите трехзначное число: "))
print("Сотни: ", a//100)